1062298577/NRF52832_MPU_AHRS/main.c
static void my_timer_handler(void * p_context)
{
		accel_values_t acc_values;
		gyro_values_t gyro_values;
		magn_values_t magn_values;
		
		float gx,gy,gz,ax,ay,az,mx,my,mz;
		
		uint32_t err_code;
		err_code = app_mpu_read_accel(&acc_values);
		APP_ERROR_CHECK(err_code);
		ax = (float)acc_values.x*Acc_G;
		ay = (float)acc_values.y*Acc_G;
		az = (float)acc_values.z*Acc_G;
		

		//NRF_LOG_INFO("\nAccel Sample # %d X: "NRF_LOG_FLOAT_MARKER" Y: ", sample_number, NRF_LOG_FLOAT(acc_values.z/16384.0));
		
		err_code = app_mpu_read_magnetometer(&magn_values, NULL);
		APP_ERROR_CHECK(err_code);
		mx = (float)magn_values.x*Mag_G;
		my = (float)magn_values.y*Mag_G;
		mz = (float)magn_values.z*Mag_G;
		//NRF_LOG_INFO("\nMagno Sample # %d X: %06d Y: %06d Z: %06d", sample_number, magn_values.x, magn_values.y, magn_values.z);

		err_code = app_mpu_read_gyro(&gyro_values);
		APP_ERROR_CHECK(err_code);
		gx = (float)gyro_values.x*Gyro_G;
		gy = (float)gyro_values.y*Gyro_G;
		gz = (float)gyro_values.z*Gyro_G;
		//NRF_LOG_INFO("\nGyro Sample # %d X: %f Y: %f Z: %f", ++sample_number, gyro_values.x/16.4, gyro_values.y/16.4, gyro_values.z/16.4);

		MadgwickAHRSupdate(gx,gy,gz,ax,ay,az,mx,my,mz);
		//MadgwickAHRSupdateIMU(gx,gy,gz,ax,ay,az);
		computeAngles();
		
	
}

static void my_timer_handler2(void * p_context)
{
	
		char sendtemp[100];
		uint16_t llength = sprintf(sendtemp,"Orientation: %.4f %.4f %.4f\r\n", yaw, pitch, roll);
				
		ble_nus_data_send(&m_nus, (uint8_t*)sendtemp, &llength, m_conn_handle);
	
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
		app_timer_create(&my_timer, APP_TIMER_MODE_REPEATED, my_timer_handler);
    app_timer_start(my_timer, APP_TIMER_TICKS(1), NULL);
		app_timer_create(&my_timer2, APP_TIMER_MODE_REPEATED, my_timer_handler2);
    app_timer_start(my_timer2, APP_TIMER_TICKS(10), NULL);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

//        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
//        {
//            do
//            {
//                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
//                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
//                {
//                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
//                    APP_ERROR_CHECK(err_code);
//                }
//            } while (err_code == NRF_ERROR_BUSY);
//        }
			
				do
				{
						uint16_t length = (uint16_t)p_evt->params.rx_data.length;
						err_code = ble_nus_data_send(&m_nus, (uint8_t*)p_evt->params.rx_data.p_data, &length, m_conn_handle);
						if ((err_code != NRF_ERROR_INVALID_STATE) &&
								(err_code != NRF_ERROR_RESOURCES) &&
								(err_code != NRF_ERROR_NOT_FOUND))
						{
								APP_ERROR_CHECK(err_code);
						}
				} while (err_code == NRF_ERROR_RESOURCES);
			
//        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
//        {
//            while (app_uart_put('\n') == NRF_ERROR_BUSY);
//        }
    }

}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

